export const categories =[{
  id: 1,
  title: "升小二"
},{
  id: 2,
  title: "升小三"
},
{
  id: 3,
  title: "升小四"
},
{
  id: 4,
  title: "升小五"
},
{
  id : 5,
  title: "升小六"
},
{
  id: 6,
  title: "升初一"
},
{
  id: 7,
  title: "升初二"
},
{
  id : 8,
  title: "升初三"
},
{
  id : 9,
  title: "升高一"
},
{
  id: 10,
  title: "升高二"
},
{
  id: 11,
  title: "升高三"
}];

export const subject = [{
    id : 1,
    title: "数学"
  },
  {
    id: 2,
    title: "语文"
  },
  {
    id: 3,
    title: "数学+语文"
}]

export const send = [
  {title:"赠送标题"}
]


export const skus = [
  ['升小二', '语文', '赠送标题'],
  ['升小二', '数学', '赠送标题'],
  ['升小二', '数学+语文', '赠送标题'],
  ['升小三', '数学',  '赠送标题'],
  ['升小四', '数学+语文', '赠送标题'],
  ['升小四', '语文', '赠送标题'],
  ['升小四', '数学', '赠送标题'],
  ['升小五', '数学', '赠送标题'],
  ['升小六', '数学+语文', '赠送标题'],
  ['升小六', '数学', '赠送标题'],
  ['升小六', '语文', '赠送标题'],
  ['升初一', '数学', '赠送标题'],
  ['升初二', '语文','赠送标题'],
  ['升初三', '语文', '赠送标题'],
  ['升高二', '数学', '赠送标题'],
  ['升高三', '数学+语文', '赠送标题'],
  ['升高三', '数学', '赠送标题'],
  ['升高三', '语文', '赠送标题']
]

export const c=['升小二','升小三','升小四','升小五','升小六','升初一','升初二','升初三','升高一','升高二','升高三']


export const k= ['数学','语文','数学+语文']

export const s=['赠送标题标题标题标题']

// 后台返回的数据可能是
// { "attrs": {
//     "goodslist": [
//       {
//         "id": 201,
//         "name":"年级",
//         "values": {
//           "listData":[
//             {
//               "id": 1,
//               "name":"升小二"
//             },
//             {
//               "id": 2,
//               "name":"升小三"
//             },
//             {
//               "id": 3,
//               "name":"升小四"
//             },
//             {
//               "id": 4,
//               "name":"升小五"
//             },
//             {
//               "id": 5,
//               "name":"升小六"
//             },
//             {
//               "id": 6,
//               "name":"升初一"
//             },
//             {
//               "id": 7,
//               "name":"升初二"
//             },
//             {
//               "id": 8,
//               "name":"升初三"
//             },
//             {
//               "id": 9,
//               "name":"升高一"
//             },
//             {
//               "id": 10,
//               "name":"升高二"
//             },
//             {
//               "id": 11,
//               "name":"升高三"
//             },
//           ]
//         },
//         {
//           "id": 202,
//           "name":"科目",
//           "values":{
//             "listData": [
//               {
//                 "id":11,
//                 "name":"数学"
//               },
//               {
//                 "id":22,
//                 "name":"语文"
//               },
//               {
//                 "id":33,
//                 "name":"数学+语文"
//               }
//             ]
//           },
//           {
//             "id":203,
//             "name":"赠送标题",
//             "values": {
//               "listData": [
//                 {
//                   "id":31,
//                   "name": "赠送标题标题"
//                 }
//               ]
//             },
//           }
//         }
//       }
//     ]
//   },
// }


// 商品规格
// 年级：  1 '升小二', 2'升小三', 3'升小四', 4'升小五', 5'升小六', 6'升初一', 7'升初二', 8'升初三', 9'升高一', 10 '升高二', 11 '升高三'
// 科目：  1 '数学', 2 '语文', 3 '数学+语文'
// 赠送标题： 1 '赠送标题标题标题标题'


//  sku 组合（自己暂定这种组合）
// ['升小二', '语文', '赠送标题'],  [1, 22, 31]
// ['升小二', '数学', '赠送标题'],  [1, 11, 31]
// ['升小二', '数学+语文', '赠送标题'],  [1, 33, 31]
// ['升小三', '数学',  '赠送标题'],  [2, 11, 31]
// ['升小四', '数学+语文', '赠送标题'],   [3, 33, 31]
// ['升小四', '语文', '赠送标题'],   [3, 22, 31]
// ['升小四', '数学', '赠送标题'],   [3, 11, 31]
// ['升小五', '数学', '赠送标题'],   [4, 11, 31]
// ['升小六', '数学+语文', '赠送标题'],  [5, 33, 31]
// ['升小六', '数学', '赠送标题'],  [5, 11, 31]
// ['升小六', '语文', '赠送标题'],   [5, 22, 31]
// ['升初一', '数学', '赠送标题'],   [6, 11, 31]
// ['升初二', '语文','赠送标题'],   [7, 22, 31]
// ['升初三', '语文', '赠送标题'],   [8, 22, 31]
// ['升高二', '数学', '赠送标题'],  [10, 11, 31]
// ['升高三', '数学+语文', '赠送标题'],  [11, 33, 31]
// ['升高三', '数学', '赠送标题'],  [11, 11, 31]
// ['升高三', '语文', '赠送标题'],  [11, 22, 31]
