export const categories =[{
  id: 1,
  title: "升小二"
},{
  id: 2,
  title: "升小三"
},
{
  id: 3,
  title: "升小四"
},
{
  id: 4,
  title: "升小五"
},
{
  id : 5,
  title: "升小六"
},
{
  id: 6,
  title: "升初一"
},
{
  id: 7,
  title: "升初二"
},
{
  id : 8,
  title: "升初三"
},
{
  id : 9,
  title: "升高一"
},
{
  id: 10,
  title: "升高二"
},
{
  id: 11,
  title: "升高三"
}];

export const subject = [{
    id : 1,
    title: "数学"
  },
  {
    id: 2,
    title: "语文"
  },
  {
    id: 3,
    title: "数学+语文"
}]

export const send = [
  {title:"赠送标题"}
]


export const skus = [
  ['升小二', '语文', '赠送标题'],
  ['升小三', '语文',  '赠送标题'],
  ['升小四', '数学+语文', '赠送标题'],
  ['升小五', '数学', '赠送标题'],
  ['升小六', '数学+语文', '赠送标题'],
  ['升初一', '数学', '赠送标题'],
  ['升初二', '语文','赠送标题'],
  ['升初三', '语文', '赠送标题'],
  ['升高二', '数学', '赠送标题'],
  ['升高三', '赠送标题标题标题标题'],
]

export const c=['升小二','升小三','升小四','升小五','升小六','升初一','升初二','升初三','升高一','升高二','升高三']


export const k= ['数学','语文','数学+语文']

export const s=['赠送标题标题标题标题']
