const attrs = {
  goodslist: [
    {
      id: 201,
      name:"年级",
      values: {
        listData:[
          {
            id: 1,
            name:"升小二"
          },
          {
            id: 2,
            name:"升小三"
          },
          {
            id: 3,
            name:"升小四"
          },
          {
            id: 4,
            name:"升小五"
          },
          {
           id: 5,
           name:"升小六"
          },
          {
           id: 6,
           name:"升初一"
          },
          {
           id: 7,
           name:"升初二"
          },
          {
           id: 8,
           name:"升初三"
          },
          {
           id: 9,
           name:"升高一"
          },
          {
           id: 10,
           name:"升高二"
          },
          {
           id: 11,
           name:"升高三"
          }
        ]
      }
    },
    {
     id: 202,
     name:"科目",
     values:{
       listData: [
          {
           id:11,
           name:"数学"
          },
          {
           id:22,
           name:"语文"
          },
          {
           id:33,
           name:"数学+语文"
          }
        ]
      }
    },
    {
     id:203,
     name:"赠送标题",
     values: {
       listData: [
          {
           id:31,
           name: "赠送标题标题"
          }
        ]
      }
    }
  ]
}
// 规格列表
export const labelGroups = [
  ["年级","升小二","升小三","升小四","升小五","升小六","升初一","升初二","升初三","升高一","升高二","升高三"],
  [ "科目","数学","语文","数学+语文"],
  ["赠送题目","赠送标题标题标题标题"]
]

  //  商品规格
  // 年级(201)：  '升小二' (1), '升小三' (2), '升小四' (3), '升小五' (4), '升小六' (5), '升初一' (6), '升初二' (7), '升初三' (8), '升高一' (9),  '升高二' (10) '升高三' (11)
  // 科目(202)：  '数学' (11),  '语文' (22),  '数学+语文' (33)
  // 赠送标题(203)：  '赠送标题标题标题标题' (31)


  //  sku 组合（自己暂定这种组合）
export const skus =[
  ['升小二', '语文', '赠送标题'],
  ['升小二', '数学', '赠送标题'],
  ['升小二', '数学+语文', '赠送标题'],
  ['升小三', '数学',  '赠送标题'],
  ['升小四', '数学+语文', '赠送标题'],
  ['升小四', '语文', '赠送标题'],
  ['升小四', '数学', '赠送标题'],
  ['升小五', '数学', '赠送标题'],
  ['升小六', '数学+语文', '赠送标题'],
  ['升小六', '数学', '赠送标题'],
  ['升小六', '语文', '赠送标题'],
  ['升初一', '数学', '赠送标题'],
  ['升初二', '语文','赠送标题'],
  ['升初三', '语文', '赠送标题'],
  ['升高二', '数学', '赠送标题'],
  ['升高三', '数学+语文', '赠送标题'],
  ['升高三', '数学', '赠送标题'],
  ['升高三', '语文', '赠送标题']
]
